Revit 2027 API
ParameterTypeId.FbxLightSourceLength Property
 "Light Source Symbol Length"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FbxLightSourceLength { get; }
Public Shared ReadOnly Property FbxLightSourceLength As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FbxLightSourceLength {
	ForgeTypeId^ get ();
}
static member FbxLightSourceLength : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace